# core tools
brew 'git'
brew 'fish'
brew 'autojump'
brew 'chruby'
brew 'ruby-install'
brew 'yarn'
brew 'ripgrep'
brew 'fzf'

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-fira-code'
cask 'font-hack-nerd-font'

# core apps
cask '1password'
cask 'dropbox'
cask 'alfred'

# databases
brew 'postgresql'
brew 'mariadb'
brew 'elasticsearch'
brew 'redis'

# development libraries
brew 'libxml2'
brew 'zlib'
brew 'ncurses'

# development tools
tap 'puma/puma'
brew 'puma-dev'
brew 'tmux'

# misc tools
brew 'ffmpeg'
brew 'youtube-dl'
brew 'get_iplayer'
brew 'jq'
brew 'editorconfig'
brew 'telnet'
brew 'curl'
brew 'cmake'

# Misc utilities
cask 'the-unarchiver'
cask 'keybase'
cask 'google-chrome'
cask 'transmit'
cask 'transmission'
cask 'skype'
cask 'slack'
cask 'hex-fiend'
cask 'daisydisk'
cask 'backblaze'
cask 'calibre'
cask 'whatsapp'

tap 'homebrew/cask-versions'

# Development tools
cask 'ngrok'
cask 'paw'
cask 'postico'
cask 'sequel-ace'
cask 'dash4'
cask 'docker'
cask 'vmware-fusion'

# Games stuff
cask 'gog-galaxy'
cask 'steam'

# App Store apps
brew 'mas'
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
mas 'Keynote', id: 409183694
mas 'iMovie', id: 408981434
mas 'Ghostery Lite', id: 1436953057
mas 'LINE', id: 539883307
mas 'Honey', id: 1472777122
mas 'NextDNS', id: 1464122853
